package com.test.java;

public class Item11 {

	public static void main(String[] args) {
		
		//[SUMMARY] 연산자 (2022. 3. 12. 오후 10:35:58)
		
		/*
		 a. 산술 연산자 (2항)
		 - +, -, *, /, %(mod, 나머지 연산자)
		 - 숫자형 피연산자를 가진다
		 - 모든 산술 연산자의 결과는 두 피연산자 중 크기가 큰 자료형으로 반환
		 - 예외: byte, short 연산의 결과는 무조건 int형
		 
		 
		 b. 비교 연산자 (2항)
		 - >, >=, <, <=, ==, !=
		 - 숫자형, char형 피연산자들의 우위(동등) 비교
		 - 결과는 boolean(true/false)
		 
		 
		 c. 논리 연산자
		 - &&(and), ||(or), !(not, 부정 연산자)
		 - &&, || (2항), ! (1항) 
		 - 피연산자, 연산자 모두 boolean 자료형
		 
		 
		 d. 대입 연산자 (2항)
		 - =, +=, -=, *=, /=, %=
		 - LValue와 RValue에 무조건 동일한 자료형 (형변환)
		 - 모든 연산자 중 우선 순위가 가장 낮다
		 
		 
		 e. 증감 연산자 (단항)
		 - ++, --
		 - a. ++n: 전위 배치(전치 연산자) > 연산자 우선 순위가 가장 높음, 소괄호 다음으로
		   b. n++: 후위 배치(후치 연산자) > 연산자 우선 순위가 가장 낮음
		   
		   
		 f. 조건 연산자 (3항)
		 - A ? B(true일 경우) : C(false일 경우)
	   	 - A: boolean
		 - B, C: 상수, 변수, 연산식, 메소드
		
		 
		 */
		 	
	}
}
